#variable - პითონის ცვლადები უბრალოდ კონტეინერებია მონაცემთა მნიშვნელობების შესანახად. სხვა ენებისგან განსხვავებით, როგორიცაა ჯავა, პითონს არ აქვს ცვლადის გამოცხადების ბრძანება, ასე რომ თქვენ ქმნით მას იმ მომენტში, როდესაც პირველად ანიჭებთ მას მნიშვნელობას.

#for example - name="viktoria sikharulidze"


#variable name - ცვლადის სახელი, ნაწილი, რომელიც წარმოადგენს მნიშვნელობას, ყოველთვის არის მინიჭების განცხადების მარცხნივ, ხოლო თავად მნიშვნელობა მარჯვნივ.

#for example - age=11 print(11)


#variable value - არის სტრინგი ინტეჯერი ან ფლოუთი რომელიც ინახება ცვალდში.

#for example - name = "viki" number = 1 float = 1,1