def კალკულატორი(num1, num2, ოპერატორი):
    if ოპერატორი == "+":
        print(num1 + num2)
    elif ოპერატორი == "-":
        print(num1 - num2)
    elif ოპერატორი == "*":
        print(num1 * num2)
    elif ოპერატორი == "/":
        if num2 != 0:
            print(num1 / num2)
        elif:
            print("გაყოფა ნულზე შეუძლებელია!")
    else:
        print("არასწორი ოპერატორი!")

# ფუნქციის გამოძახება სამჯერ
კალკულატორი(10, 5, "+")
კალკულატორი(20, 8, "-")
კალკულატორი(6, 3, "*")
